[
  {
    "id": "sporulation_dataset",
    "title": "Genomes with associated sporulation metadata",
    "short_description": "This dataset contains reference genomes from the subset of the BacDive database that has metadata information for sporulation ability. Here comes a longer descritpion on the dataset.",
    "description": "The BacDive Sporulation Prediction Dataset has been curated for the purpose of training deep learning models to predict bacterial sporulation based on a diverse set of microbial features. BacDive, a comprehensive bacterial diversity database, serves as the primary source of data. This dataset aims to facilitate research in the field of microbiology and bioinformatics by providing a standardized and structured collection of information. The dataset encompasses a wide array of features extracted from BacDive, including genomic information in the form of DNA sequences, environmental conditions such as temperature, pH levels, and nutrient concentrations, along with detailed information about bacterial species and strains. One of the key components of this dataset is the historical sporulation data, which serves as the target variable for predictive modeling. Each data entry in this dataset is presented in CSV format, with rows representing individual bacterial samples and columns containing the various features and corresponding sporulation labels. The labels are binary, indicating whether sporulation occurred (1) or not (0) for each bacterial entry. To ensure robust model training, the dataset comprises a substantial number of samples, with 10,000 instances earmarked for training and an additional 2,000 samples for testing and validation purposes. This dataset offers a valuable resource for researchers and practitioners in the domain of microbiology and machine learning. Its structured format and diverse feature set make it a suitable choice for developing predictive models to understand and predict bacterial sporulation patterns, ultimately contributing to advancements in the field.",
    "authors": ["unpublished"],
    "categories": ["morphology prediction"],
    "data_format": ["FASTA"],
    "data_type": ["full genomes", "reads"],
    "class_type": "binary model",
    "citation": "none",
    "keywords": ["imputation", "preprocessing"],
    "file_size": "10GB",
    "creation_date": "2021-09-01",
    "last_updated": "2023-05-01",
    "number_of_samples": 100000,
    "class_distribution": {
      "ClassA": "60%",
      "ClassB": "40%"
    },
    "license": "Open Source",
    "source": "BacDive Database",
    "preprocessing_info": "Quality filtered with Q>30",
    "data_quality_metrics": {
      "average_read_length": "150bp",
      "average_coverage": "30x"
    },
    "associated_tasks": ["taxonomic classification"],
    "download_link": "http://example.com/download/sporulation_dataset.zip",
    "sample_data_link": "http://example.com/sample/sporulation_sample.zip",
    "related_publications": ["DOI: 10.1234/abcd5678"],
    "comments": "Ensure adequate storage space before downloading."
  }
]
